# RoomTagFilter Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoomTagFilter Constructor
RoomTagFilter Class See Also
---
Constructs a filter which matches only rooms.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RoomTagFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
RoomTagFilter()
```

# See Also
RoomTagFilter Class
Autodesk.Revit.DB.Architecture Namespace